[
  {
    "finding_id": "fTjva6UwLE4_6",
    "text": "Early Christian polemics echo Greco-Egyptian descent-to-Hades narratives (Orpheus myth), but with Christian \"one-upmanship\": while Orpheus fails to retrieve his wife from Hades, Jesus succeeds in rescuing righteous souls imprisoned for millennia, demonstrating superior divine power and authority.",
    "quote": "you've got to be thinking to yourself where orpheus failed it's it's not in his power to take his wife back...well that's not what happens for for jesus jesus takes up everybody who's righteous since adam and eve...christianity is a whole lot better",
    "source_chapter": 2
  },
  {
    "finding_id": "65Ii0MVe7hA_0",
    "text": "Dennis MacDonald's analysis of Homeric mimesis in the Gospel of Mark supports the book's Greco-Christian framework thesis. The parallel between Homer's account of Hermes conducting Priam past sleeping guards and open doors (Iliad 24) and Mark's resurrection narrative (guards struck senseless, tomb opened) demonstrates how Gospel authors used Greek literary structures to convey theological concepts about divine power and authority.",
    "quote": "in the gospel of mark is an unusual narrative about guards at the tomb then falls are stricken like dead men when jesus comes out of the tomb that is the tomb is open the guards are put to sleep and the words for guards and for the door are exactly the same as you have in homework",
    "source_chapter": 3
  },
  {
    "finding_id": "qaGz4eDqIUA_0",
    "text": "Egyptian theology of divine kingship—understanding a king as simultaneously human and divine—provides institutional-theological precedent for \"Son of God\" as political designation rather than metaphysical claim.",
    "quote": "Egyptians grappled with this arguably more than anybody else because the king is human and here on Earth and yet is meant to be The Offspring of divinity right so how do you have human being on Earth who is divine who will still die... Jesus is a part of that discussion he is part Divine he is part human he is Mortal he can be killed he can be reborn",
    "source_chapter": 6
  }
]